package it.saimao.shan_language_tools.breakers;

import org.junit.Assert;
import org.junit.Test;

public class TaiLeSyllableSegmentationTest {

    @Test
    public void test_segment_with_tone() {
        String input = "ᥖᥥᥲᥘᥭᥴᥑᥪᥢᥲᥛᥫᥰᥞᥩᥖᥲᥗᥪᥒᥴᥙᥣᥭᥚᥨᥭᥰᥞᥣᥳ";
        String output = TaiLeSyllableSegmentation.segmentAsString(input);
        Assert.assertEquals("ᥖᥥᥲ ᥘᥭᥴ ᥑᥪᥢᥲ ᥛᥫᥰ ᥞᥩᥖᥲ ᥗᥪᥒᥴ ᥙᥣᥭ ᥚᥨᥭᥰ ᥞᥣᥳ", output);
    }

    @Test
    public void test_segment_without_tone() {
        String input = "ᥖᥥᥘᥭᥑᥪᥢᥛᥫᥞᥩᥖᥗᥪᥒᥙᥣᥭᥚᥨᥭᥞᥣ";
        String output = TaiLeSyllableSegmentation.segmentAsString(input);
        Assert.assertEquals("ᥖᥥ ᥘᥭ ᥑᥪᥢ ᥛᥫ ᥞᥩᥖ ᥗᥪᥒ ᥙᥣᥭ ᥚᥨᥭ ᥞᥣ", output);
    }

    @Test
    public void test_segment1() {
//        String input = "ᥙᥥᥢᥴᥞᥪᥴᥐᥩᥲ ᥓᥣᥭᥰᥖᥥᥴᥘᥣᥖᥲᥢᥦᥴ ᥘᥩᥒᥲᥟᥢᥴᥙᥤᥲ ᥞᥐᥳᥛᥦᥢᥢᥫᥴᥢᥩᥒᥳᥕᥝᥳ၊ ᥢᥩᥒᥳᥞᥣᥒᥘᥤ ᥓᥣᥭᥰᥞᥐᥳᥢᥩᥒᥳ ᥘᥨᥢᥳᥘᥫᥴᥢᥣᥱᥕᥝᥳ။";
        String input = "ᥒᥣᥝᥰᥘᥣᥭᥰᥛᥣᥢᥲᥛᥫᥒᥰᥐᥩᥲ ᥓᥧᥛᥰᥟᥨᥭᥰᥘᥤᥴᥘᥦᥲ sspp ᥖᥥᥴᥞᥭᥱᥐᥢᥴᥕᥝᥳᥑᥣᥲᥕᥨᥝᥳ. ᥖᥤᥲᥢᥛᥳᥙᥣᥢᥰᥢᥛᥳᥔᥩᥢᥰ ᥟᥢᥴ sspp ᥑᥝᥴᥕᥧᥱᥝᥭᥳᥢᥢᥳ ᥘᥭᥲᥒᥤᥢᥰᥑᥣᥝᥴᥝᥭᥳᥝᥣᥲ ᥞᥬᥲᥙᥣᥭᥐᥣᥱᥖᥤᥲᥘᥩᥖᥲᥚᥥᥰᥢᥭᥴᥝᥣᥱ. ᥖᥤᥲᥗᥧᥒᥳᥛᥣᥝᥰᥢᥭᥳᥖᥥᥳ ᥐᥨᥢᥰᥖᥭᥰᥖᥧᥐᥳᥑᥣᥳᥞᥦᥒᥰᥢᥣᥱᥑᥣᥲ. ᥙᥤᥲᥢᥩᥒᥳᥑᥣᥲᥖᥤᥲᥢᥛᥳᥑᥛᥰᥐᥩᥲ ᥛᥣᥰᥕᥧᥱᥖᥤᥲᥞᥫᥢᥰᥑᥣᥲ ᥙᥩᥰᥘᥭᥲ 3 ᥝᥨᥒᥴᥙᥣᥭᥴᥕᥝᥳ".trim();
        String output = TaiLeSyllableSegmentation.segmentAsString(input);
        Assert.assertEquals("ᥒᥣᥝᥰ ᥘᥣᥭᥰ ᥛᥣᥢᥲ ᥛᥫᥒᥰ ᥐᥩᥲ ᥓᥧᥛᥰ ᥟᥨᥭᥰ ᥘᥤᥴ ᥘᥦᥲ s s p p ᥖᥥᥴ ᥞᥭᥱ ᥐᥢᥴ ᥕᥝᥳ ᥑᥣᥲ ᥕᥨᥝᥳ . ᥖᥤᥲ ᥢᥛᥳ ᥙᥣᥢᥰ ᥢᥛᥳ ᥔᥩᥢᥰ ᥟᥢᥴ s s p p ᥑᥝᥴ ᥕᥧᥱ ᥝᥭᥳ ᥢᥢᥳ ᥘᥭᥲ ᥒᥤᥢᥰ ᥑᥣᥝᥴ ᥝᥭᥳ ᥝᥣᥲ ᥞᥬᥲ ᥙᥣᥭ ᥐᥣᥱ ᥖᥤᥲ ᥘᥩᥖᥲ ᥚᥥᥰ ᥢᥭᥴ ᥝᥣᥱ . ᥖᥤᥲ ᥗᥧᥒᥳ ᥛᥣᥝᥰ ᥢᥭᥳ ᥖᥥᥳ ᥐᥨᥢᥰ ᥖᥭᥰ ᥖᥧᥐᥳ ᥑᥣᥳ ᥞᥦᥒᥰ ᥢᥣᥱ ᥑᥣᥲ . ᥙᥤᥲ ᥢᥩᥒᥳ ᥑᥣᥲ ᥖᥤᥲ ᥢᥛᥳ ᥑᥛᥰ ᥐᥩᥲ ᥛᥣᥰ ᥕᥧᥱ ᥖᥤᥲ ᥞᥫᥢᥰ ᥑᥣᥲ ᥙᥩᥰ ᥘᥭᥲ 3 ᥝᥨᥒᥴ ᥙᥣᥭᥴ ᥕᥝᥳ ".trim(), output);
        System.out.println(input + "\n" + output);

    }

    @Test
    public void test_segment3() {
        String input = "ᥝᥤᥱᥑᥤᥱᥚᥤᥱᥖᥤᥱᥕᥣᥱᥟᥢᥘᥭᥳ ᥙᥥᥢᥙᥙᥐᥧᥔᥦᥢᥴᥔᥛᥱᥟᥢᥖᥣᥱᥐᥨᥢᥰᥖᥒᥰᥘᥛᥴ ᥞᥨᥛᥐᥢᥖᥦᥛᥲᥓᥦᥖᥘᥢᥳᥕᥝᥳ. ᥓᥬᥳᥖᥪᥰᥝᥭᥳ (ᥝᥦᥙᥱᥕᥣᥒᥱ) (ᥝᥦᥙᥔᥣᥭᥳ) ᥟᥢᥞᥩᥒᥳᥝᥣ ᥝᥤᥱᥑᥤᥱᥘᥢᥳᥔᥥᥴ ᥔᥣᥒᥲᥟᥩᥐᥱᥞᥬᥲᥖᥣᥱᥐᥨᥢᥰᥖᥒᥰᥘᥛᥴ ᥞᥨᥛᥐᥢᥖᥦᥛᥲᥓᥦᥖᥘᥭᥲᥘᥢᥳ. ᥐᥨᥢᥰᥖᥒᥰᥘᥛᥴ ᥟᥩᥢᥐᥢᥖᥦᥛᥲᥓᥦᥖᥛᥥᥰᥐᥥᥲᥘᥭᥲ ᥞᥥᥖᥱᥞᥬᥲ ᥝᥤᥱᥑᥤᥱᥚᥤᥱᥖᥤᥱᥕᥣᥱ ᥖᥫᥰᥘᥤᥔᥥᥴᥟᥩᥢᥖᥩᥢᥰ ᥘᥫᥴᥔᥥᥴᥐᥝᥱᥕᥧᥱᥘᥢᥳᥘᥭᥴᥕᥝᥳ. ᥖᥤ ᥝᥤᥱᥑᥤᥱᥚᥤᥱᥖᥤᥱᥕᥣᥱᥖᥭᥰᥘᥭᥳ ᥖᥥᥴᥘᥭᥲᥕᥧᥒᥱᥖᥪᥰ (ᥜᥩᥢᥳ) ᥓᥫᥰᥟᥢᥔᥣᥒᥲᥓᥩᥛᥰ ᥘᥐᥴᥑᥥᥒᥱ (ᥕᥧᥱᥢᥤᥱᥑᥨᥖᥳ) ᥔᥥᥴᥖᥦᥛᥲᥘᥭᥲᥓᥦᥖᥘᥭᥲᥕᥧᥱᥕᥝᥳ.";
        String expected = "ᥝᥤᥱ ᥑᥤᥱ ᥚᥤᥱ ᥖᥤᥱ ᥕᥣᥱ ᥟᥢ ᥘᥭᥳ ᥙᥥᥢ ᥙᥙ ᥐᥧ ᥔᥦᥢᥴ ᥔᥛᥱ ᥟᥢ ᥖᥣᥱ ᥐᥨᥢᥰ ᥖᥒᥰ ᥘᥛᥴ ᥞᥨᥛ ᥐᥢ ᥖᥦᥛᥲ ᥓᥦᥖ ᥘᥢᥳ ᥕᥝᥳ . ᥓᥬᥳ ᥖᥪᥰ ᥝᥭᥳ ( ᥝᥦᥙᥱ ᥕᥣᥒᥱ ) ( ᥝᥦᥙ ᥔᥣᥭᥳ ) ᥟᥢ ᥞᥩᥒᥳ ᥝᥣ ᥝᥤᥱ ᥑᥤᥱ ᥘᥢᥳ ᥔᥥᥴ ᥔᥣᥒᥲ ᥟᥩᥐᥱ ᥞᥬᥲ ᥖᥣᥱ ᥐᥨᥢᥰ ᥖᥒᥰ ᥘᥛᥴ ᥞᥨᥛ ᥐᥢ ᥖᥦᥛᥲ ᥓᥦᥖ ᥘᥭᥲ ᥘᥢᥳ . ᥐᥨᥢᥰ ᥖᥒᥰ ᥘᥛᥴ ᥟᥩᥢ ᥐᥢ ᥖᥦᥛᥲ ᥓᥦᥖ ᥛᥥᥰ ᥐᥥᥲ ᥘᥭᥲ ᥞᥥᥖᥱ ᥞᥬᥲ ᥝᥤᥱ ᥑᥤᥱ ᥚᥤᥱ ᥖᥤᥱ ᥕᥣᥱ ᥖᥫᥰ ᥘᥤ ᥔᥥᥴ ᥟᥩᥢ ᥖᥩᥢᥰ ᥘᥫᥴ ᥔᥥᥴ ᥐᥝᥱ ᥕᥧᥱ ᥘᥢᥳ ᥘᥭᥴ ᥕᥝᥳ . ᥖᥤ ᥝᥤᥱ ᥑᥤᥱ ᥚᥤᥱ ᥖᥤᥱ ᥕᥣᥱ ᥖᥭᥰ ᥘᥭᥳ ᥖᥥᥴ ᥘᥭᥲ ᥕᥧᥒᥱ ᥖᥪᥰ ( ᥜᥩᥢᥳ ) ᥓᥫᥰ ᥟᥢ ᥔᥣᥒᥲ ᥓᥩᥛᥰ ᥘᥐᥴ ᥑᥥᥒᥱ ( ᥕᥧᥱ ᥢᥤᥱ ᥑᥨᥖᥳ ) ᥔᥥᥴ ᥖᥦᥛᥲ ᥘᥭᥲ ᥓᥦᥖ ᥘᥭᥲ ᥕᥧᥱ ᥕᥝᥳ .";
        String output = TaiLeSyllableSegmentation.segmentAsString(input);
        Assert.assertEquals(expected, output);
        System.out.println(input + "\n" + output);

    }

    @Test
    public void test_segment2() {
        String expected = "ᥙᥪᥢᥰ ᥟᥢ ᥝᥣ ᥘᥭᥳ ᥙᥥᥢ ᥙᥣᥭᥰ ᥟᥢ ᥘᥥᥙ ᥞᥥᥢᥰ ᥑᥪᥢᥰ ᥘᥩᥒ ᥝᥢᥰ ᥘᥒᥴ ᥐᥨᥢᥰ၊ ᥛᥣᥢᥲ ᥛᥫᥒᥰ၊ ᥓᥫᥳ ᥑᥫᥰ၊ ᥚᥤᥒᥲ ᥒᥥ ... ᥓᥫᥰ ᥟᥢ ᥘᥭᥲ ᥙᥥᥢ ᥙᥨᥢᥳ ᥛᥣᥰ ᥘᥢᥳ ᥕᥝᥳ။ ᥝᥣᥭᥰ ᥔᥥᥴ ᥛᥤᥰ ᥛᥣᥰᥘᥤᥐ ᥘᥣᥭᥰ ᥕᥝᥳ ᥙᥪᥢᥰ ᥘᥭᥳ ᥐᥩᥲ ᥙᥥᥢ ᥛᥣᥰ ᥛᥤᥰ ᥛᥣᥰ ᥘᥭᥴ ᥐᥩᥲ ᥝᥣ ᥘᥭᥲ ᥕᥧᥱ။ ᥐᥨᥝᥳ ᥟᥢ ᥖᥦᥛᥲ ᥙᥪᥢᥰ ᥘᥢᥳ ᥞᥩᥒᥳ ᥝᥣ ᥚᥧᥱ ᥘᥨᥒᥳ ᥙᥪᥢᥰ ᥘᥭᥴ ᥕᥧᥱ။ ᥙᥪᥢᥰ ᥟᥢ ᥝᥣ ᥘᥭᥳ ᥙᥥᥢ ᥖᥣᥒᥰ ᥛᥨᥝᥴ ᥙᥫᥒ ᥘᥫᥒ ᥟᥢ ᥑᥪᥢᥰ ᥓᥩᥙᥱ ᥞᥣᥴ ᥖᥨᥭᥰ ᥘᥩᥒ ᥖᥣᥒᥰ ᥟᥢ ᥙᥥᥢ ᥙᥨᥢᥳ ᥛᥣᥰ ᥓᥫᥰ ᥘᥢᥳ ᥔᥥᥴ ᥟᥛᥱ ᥐᥣᥰ ᥑᥪᥢᥰ ᥛᥣᥰ ᥗᥖᥴ ᥖᥨᥭᥰ ᥑᥣᥛᥰ ᥐᥢ ᥐᥩᥭᥰ ᥞᥬᥲ ᥙᥨᥝᥰ ᥞᥧᥳ ᥗᥪᥒᥴ ᥘᥩᥒ ᥙᥥᥢ ᥛᥣᥰ ᥟᥢ ᥖᥥᥳ ᥛᥢᥰ ᥘᥢᥳ ᥕᥝᥳ။";
        String input = "ᥙᥪᥢᥰᥟᥢᥝᥣᥘᥭᥳ ᥙᥥᥢᥙᥣᥭᥰᥟᥢᥘᥥᥙᥞᥥᥢᥰᥑᥪᥢᥰᥘᥩᥒᥝᥢᥰᥘᥒᥴ ᥐᥨᥢᥰ၊ ᥛᥣᥢᥲᥛᥫᥒᥰ၊ ᥓᥫᥳᥑᥫᥰ၊ ᥚᥤᥒᥲᥒᥥ... ᥓᥫᥰᥟᥢᥘᥭᥲᥙᥥᥢᥙᥨᥢᥳᥛᥣᥰᥘᥢᥳᥕᥝᥳ။ ᥝᥣᥭᥰᥔᥥᥴᥛᥤᥰᥛᥣᥰᥘᥤᥐᥘᥣᥭᥰᥕᥝᥳ ᥙᥪᥢᥰᥘᥭᥳᥐᥩᥲᥙᥥᥢᥛᥣᥰ ᥛᥤᥰᥛᥣᥰᥘᥭᥴᥐᥩᥲᥝᥣᥘᥭᥲᥕᥧᥱ။ ᥐᥨᥝᥳᥟᥢᥖᥦᥛᥲᥙᥪᥢᥰᥘᥢᥳ ᥞᥩᥒᥳᥝᥣ ᥚᥧᥱᥘᥨᥒᥳᥙᥪᥢᥰᥘᥭᥴᥕᥧᥱ။ ᥙᥪᥢᥰᥟᥢᥝᥣᥘᥭᥳ ᥙᥥᥢᥖᥣᥒᥰᥛᥨᥝᥴᥙᥫᥒᥘᥫᥒ ᥟᥢᥑᥪᥢᥰᥓᥩᥙᥱᥞᥣᥴᥖᥨᥭᥰ ᥘᥩᥒᥖᥣᥒᥰᥟᥢᥙᥥᥢᥙᥨᥢᥳᥛᥣᥰ ᥓᥫᥰᥘᥢᥳᥔᥥᥴᥟᥛᥱᥐᥣᥰ ᥑᥪᥢᥰᥛᥣᥰᥗᥖᥴᥖᥨᥭᥰᥑᥣᥛᥰᥐᥢᥐᥩᥭᥰ ᥞᥬᥲᥙᥨᥝᥰᥞᥧᥳᥗᥪᥒᥴᥘᥩᥒᥙᥥᥢᥛᥣᥰ ᥟᥢᥖᥥᥳᥛᥢᥰᥘᥢᥳᥕᥝᥳ။";
        String output = TaiLeSyllableSegmentation.segmentAsString(input);
        Assert.assertEquals(expected, output);
        System.out.println(input + "\n" + output);
    }

}